w4d4/W4D3-master/skeleton/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["end_date", "2017-01-02"], ["start_date", "2017-01-01"], ["status", "PENDING"], ["created_at", "2017-01-18 22:42:38.298109"], ["updated_at", "2017-01-18 22:42:38.298109"]]